[
  {"id": 1, "name": "The Streets", "explanation": "Matty holds a deep admiration for 'The Streets', considering them his favorite band. His favorite song by them is 'It's Too Late'. Also Matty appreciates Mike Skinner's conversational style a lot."},
  {"id": 2, "name": "I'm Elegant", "explanation": "This poster embodies Matty's style and extravagance, represented by the elegant pink cat figure."},
  {"id": 3, "name": "DFA", "explanation": "A reference to Azealia Banks' comment on Instagram, where she says, '1975 are clearly reaching for a Death From Above 1979 aesthetic that they're just never gonna get' (what nonsense tho)"},
  {"id": 4, "name": "Cancelled", "explanation": "Due to Matty's controversial remarks and eccentric behaviour, the band's concerts were subject to cancellation. For example, The Good Vibes music festival in Malaysia was canceled after Matty delivered his speech and kissed bass player Ross during their performance on July 21, 2023. Additionally, they had to cancel shows in Taiwan and Muslim-majority Indonesia just one day after Malaysia."},
  {"id": 5, "name": "4 Days Since Last Incident", "explanation": "This is a reference to the fact that, given Matty's behavior and statements both on and off the stage, one can consider and celebrate days that pass without any incidents."},
  {"id": 6, "name": "Flushed Away", "explanation": "Matty shared an unexpected connection between his family and the animated movie 'Flushed Away'. His mother, Denise Welch, is the goddaughter of the film's producer, Jan La Fraene. This close relationship led to a young Matty became the inspiration for the character Roddy St. James, famously known as Ratty, in the animated film. Matty revealed this story at a concert in Australia and confessed that he had kept this humorous secret to himself for a long time."},
  {"id": 7, "name": "God Save The Queen", "explanation": "Matty's mother, Denise Welch, is a British actress who is just as beloved by fans as the band, earning her the title of 'Queen Denise.' She will also be taking part in a new musical about the life of Princess Diana, where she will portray Queen Elizabeth II. The musical is set to make its debut in London in December 2023."},
  {"id": 8, "name": "Good Boy Points", "explanation": "This is a reference to the fact that Matty often finds himself in scandals, and to prevent them, he can reward himself with 'good boy points'."},
  {"id": 9, "name": "'Life's too short to drink crappy coffee and cry over boys who don't care'", "explanation": "These and similar vanilla-depressively-sappy phrases are fake Tumblr quotes that are captioned in Matty's name to make them gain popularity."},
  {"id": 10, "name": "Still... At Their Very Best", "explanation": "This neon sign is a stage decoration that was used during the band's eponymous tour in 2022-2024."},
  {"id": 11, "name": "New Castle United", "explanation": "Newcastle United Football Club is a professional football club located in Newcastle, England, and competes in the Premier League, the top tier of English football. Matty supports Newcastle United due to his strong connections to the region. He spent part of his early years on Tyneside as the son of prominent Newcastle residents, Denise Welch and Tim Healy. His father had ties to the football club through his work on the television show 'Auf Wiedersehen, Pet' in the 1980s and was friends with people associated with Newcastle United. Matty practically grew up near St. James' Park stadium and the club's training facility, which further deepened his attachment to the team. As a fan, Matty even had the Newcastle United Football Club logo tattooed on the upper side of his right arm."},
  {"id": 12, "name": "Bee Movie", "explanation": "It's a favourite movie of a guitar player Adam"},
  {"id": 13, "name": "Frozen", "explanation": "Matty is a big fan of the movie Frozen, and he would often talk extensively about how good it is."},
  {"id": 14, "name": "3:05/1:02", "explanation": "The clock displays two times: 3:05 - a reference to the song 'Menswear' from The 1975's debut album, with the lyrics: 'Because it's five past three, I can hardly see, And I'm on the verge of passing out.' 1:02 - a reference to the song '102', which holds special significance for Matty, as it was written during the band's early years when he was 15. In his own words, 'This song is about a girl [friend] that I had. She was beautiful, absolutely beautiful. I loved her but she didn't feel the same way. I don't even think she knew I loved her. This song is about the times I had with her. As she and I became close friends, we had traditions. It was kinda like our thing, y'know? We'd somehow always coincidentally be out at exactly 1:02AM, so that was our thing. Now whenever I'm awake at 1:02AM, I think of her and I let her go.'"},
  {"id": 15, "name": "Eye-flower", "explanation": "This symbol appears in the 'Birthday Party' music video on a shirt worn by Matty. In surrealist art, it is a common symbol representing various concepts. It can symbolize finding beauty in the world, the connection between nature and humanity, the eye as a window to the soul, or seeing the world with fresh eyes."},
  {"id": 16, "name": "Neon-lighted Door", "explanation": "The neon rectangular backlight is a reference to the rectangular symbol of the band, which is minimalist and memorable. Additionally, the rectangular backlight is often used as a stage decoration during the band's performances. This symbol is featured on the first two studio albums of the group, becoming their iconic emblem among fans. Matty also has a tattoo in the shape of a rectangle because the band holds great significance in his life."},
  {"id": 17, "name": "South Korea", "explanation": "The picture of Matty standing on the South Korean flag after the band's 2019 performance in Seoul generated controversy. Although the photo was eventually deleted, it triggered public outrage due to the perceived disrespect toward the national flag of South Korea. It's important to emphasize that Matty did not have any intention of showing disrespect."},
  {"id": 18, "name": "Irish Army", "explanation": "At The 1975 concert in Dublin, Matty referred to the Irish as 'simple people', which caused outrage among some Irish individuals. This led to mixed reactions among fans and sparked discussions on social media."},
  {"id": 19, "name": "Brasil", "explanation": "For a long time, the band did not perform concerts in Brazil, even though they had a significant fan base there. This led to the question 'When will you come to Brazil?' becoming a meme. The band eventually performed in Brazil in 2017 and 2023 at the Lollapalooza festival."},
  {"id": 20, "name": "Drone", "explanation": "Matty hates drones at his shows. There was an incident where, during the set at the Good Vibes Festival, he was spotted capturing a drone when it came too close to him. After grabbing it, he threw it to the ground, and as if that wasn't sufficient, he stomped on it, destroying it."},
  {"id": 21, "name": "Peep Show", "explanation": "Matty is a huge fan of Peep Show."},
  {"id": 22, "name": "Instagram", "explanation": "The poster is a reference to the lyrics from the song 'A Change of Heart': 'And then you took a picture of your salad, And put it on the Internet.' It symbolizes people's preoccupation with social media, where every move is now broadcast on the internet."},
  {"id": 23, "name": "Do not use, emergency only!", "explanation": "This is a reference to the music video of 'The Birthday Party', where a robot provided a mindshower digital detox. It also connects to Matty's statements about spending a lot of time online. However, during concerts, he repeatedly urged the audience not to record the performance but to enjoy the live show and be in the moment."},
  {"id": 24, "name": "'I'm Not Beatnic, I'm Catholic'", "explanation": "The phrase 'I'm not a beatnik. I'm a Catholic' is a quote by Jack Kerouac, whose novel 'On The Road' inspired the name of the world's best band, THE 1975. Matty received the book 'On The Road' in Majorca, Spain, when he befriended the man who gifted him several books, including this one. Matty noticed on the back page that there were many suicidal messages and a date, '1st June, 1975.' This date, along with the use of 'the' sparked the idea for the band's name, which remains with the band to this day."},
  {"id": 25, "name": "Handcuff", "explanation": "The handcuffs have a dual symbol. Firstly, they reference the 'rumors' that the other band members didn't get along with Matty after his stage antics. Secondly, they serve as a metaphor for being held hostage by his vices, as well as symbolizing that Matty is a captive of his own art."},
  {"id": 26, "name": "Cowboy Hat And Wheat", "explanation": "This symbol holds a dual significance. Firstly, it's a fandom joke referred to as 'farmer fantasy Matty.' Secondly, in an interview with Zane Lowe Matty explained that his interest in country music is rooted in his northern English background, which shares cultural similarities with the southern regions of the United States. He also emphasised that country music has had a significant impact on some of The 1975's songs."},
  {"id": 27, "name": "Oasis", "explanation": "This poster is a reference to a situation where Matty, in an interview, expressed his regret that a great band like Oasis had broken up. He suggested that they should reunite and continue making great music. In response, Noel Gallagher, one of the members of Oasis, sharply stated that it's not Matty's business whether they should reunite or not."},
  {"id": 28, "name": "Maroon 5", "explanation": "The 1975 has a long-standing feud with Maroon 5. Maroon 5 accused The 1975 of plagiarizing their artwork, specifically by comparing the album artwork of Maroon 5's 1997 album 'The Fourth World' from their time as Kara's Flowers to promotional artwork used by The 1975 for their single 'Me & You Together Song.' The official Maroon 5 Twitter account playfully tweeted at The 1975, asking if they were fans of Kara's Flowers. In response Matty dismissed the comparison, stating that he didn't know what Kara's Flowers was but jokingly mentioned Maroon 5's song 'Payphone.' This exchange sparked a broader discussion on social media about the originality of artwork in the music industry and references to similar visual styles used by various bands over the years. Also, as a result of this feud, Matty used the name of Maroon 5's lead singer, Adam Levine, as a pseudonym when staying in a hotel and created an Instagram story about it."},
  {"id": 29, "name": "Naloxone Saves Lives", "explanation": "Naloxone is a reference to antidepressants that helped Matty cope with depression."},
  {"id": 30, "name": "IDs", "explanation": "IDs are a reference to Matty's famous kisses with random fans during the song 'Robbers' on the 'Still... At Their Very Best' tour, with an implication that he must check if those he kisses are over 18 to avoid legal repercussions."},
  {"id": 31, "name": "Lost Dog", "explanation": "During the pandemic, Matty got himself a puppy named Mayhem and spent a lot of time with it. However, Mayhem later disappeared from the fans' view, which became a meme, like 'where did the dog go?'"},
  {"id": 32, "name": "Mirror", "explanation": "This mirror and its reflection symbolize the unreality of life, as if we all live in 'The Truman Show.' These thoughts struck Matty after he watched it, contributing to the blurring of lines between what he considered real and fake."},
  {"id": 33, "name": "Map", "explanation": "This map represents the road between the cities where Matty lived: Newcastle, Manchester, Leeds, and Wilmslow. Now, whenever the band plays a show in Northern England, Matty will subtly change what he considers his 'hometown' (e.g., if he's in Manchester, it's there; in Newcastle, it's there; in Leeds, it's there, etc.)."},
  {"id": 34, "name": "Measures", "explanation": "The height marks on the wall are a reference to discussions about the band members' heights, where they joke about Matty's shorter stature compared to the others."},
  {"id": 35, "name": "Looking For Goth Gf", "explanation": "In the 'The Birthday Party' music video, Matty hung such announcements on trees. Interestingly, his girlfriend Gabriette, with whom they got together three years after the video was released, has a gothic style, which makes one wonder about Matty's prophetic ability."},
  {"id": 36, "name": "Minion", "explanation": "A gossip account (Deuxmoi) was discussing Matty's love life. As part of it, their 'insider' mentioned that he was sending minion memes to someone he spent the night with, which subsequently turned the minion into a meme."},
  {"id": 37, "name": "La poesie est dans la rue", "explanation": "This phrase, which translates to 'Poetry is on the streets,' is used by the band in a various ways, such as in their music videos, including 'Robbers' and 'Love It If We Made It.' to underline the idea that poetry and art can be found in ordinary, everyday experiences, especially in the streets. It's also a common fan tattoo."},
  {"id": 38, "name": "Camera", "explanation": "A camera is a reminder of how fans of the band constantly record videos during their concerts, which Matty has repeatedly emphasized is not the best choise, as they lose the opportunity to be in the moment at the concert and have a live experience."},
  {"id": 39, "name": "Backstreet Boys", "explanation": "The famous Backstreet Boys song 'I Want It That Way' was Matty's favorite song that he sang before 'She's American' during the tour in spring/summer 2023."},
  {"id": 40, "name": "Blink-182", "explanation": "The Blink-182 poster is related to the musical group that Matty loves. There's also the story of Matty noticing Blink-182's Tom DeLonge in the crowd during their Lollapalooza performance. He came down from the stage, and expressed his admiration. Matty credited DeLonge with inspiring him and his openness in discussing personal topics."},
  {"id": 41, "name": "Ghost On The Island", "explanation": "The poster with a ghost on the island is a reference to the lyrics of the song 'Antichrist': 'And I swear there's a ghost on this island...'"},
  {"id": 42, "name": "Red Box", "explanation": "tbh I don't know what's the reference here, so will be happy if you know it and share with us in comments"},
  {"id": 43, "name": "I pissed myself...", "explanation": "It's the reference to the song 'Roadkill' and the lyrics, 'I pissed myself on the Texan intersection...'"},
  {"id": 44, "name": "Hair Gel", "explanation": "In 2022 Matty decided to put his curls on a temporary vacation and opted for that sleek, gel-slicked look. Some fans weren't too thrilled, missing those signature curls of his."},
  {"id": 45, "name": "Malaysia", "explanation": "The Malaysian flag symbolizes the incident where Matty kissed the bassist Ross on stage during the concert in 2023 and delivered a statement about the significance of inviting a band that advocates for freedom in all its forms, including the freedom to love and kiss whomever one desires. After this event, the concert was halted, and the band faced bans in Malaysia and several other Muslim-majority countries. This was due to the fact that, according to the country's laws, any association with LGBTQ+ matters is subject to legal punishment."},
  {"id": 46, "name": "United Arab Emirates", "explanation": "In 2019, during a concert in Dubai, Matty broke Dubai's laws against LGBTQ+ activities by expressing his love for LGBTQ+ fans, stating that he loves them and that God loves them too. He also entered the crowd and kissed a male fan on the lips. Dubai has strict laws against LGBTQ+ activities, which made this act a significant statement."},
  {"id": 47, "name": "Wizard Adam", "explanation": "In one of the interviews, the guitarist Adam drew himself as a wizard. Following this, the phrase 'I'm a wizard!' became a meme associated with him."},
  {"id": 48, "name": "Diper And Milk Bottle", "explanation": "The baby bottle and diaper symbolize the guitarist Adam's fatherhood. In the video 'A theatrical performance of an intimate moment (episode 3),' Adam shares his feelings about having limited time with his son due to work commitments. He expresses deep longing for his son, emphasizing that there are moments in life you don't get a second chance to experience, making his fatherhood all the more significant."},
  {"id": 49, "name": "Cross", "explanation": "The question of religion is quite complex for Matty. Although he was baptized as a Catholic, there's an interview where he states that he's an atheist. The faith and religion question is evident in his songwriting, from 'Antichrist' to more recent songs like 'If I Believe You.'"},
  {"id": 50, "name": "Old Computer", "explanation": "The computer here serves as a substitute for a friend and partner, referencing the song 'The Man Who Married A Robot.' The song reflects our digital age, the dependency on the internet and social media, and the isolation that can result from an increasing reliance on technology."},
  {"id": 51, "name": "Footstep", "explanation": "tbh I don't know what's the reference here, so will be happy if you know it and share with us in comments"},
  {"id": 52, "name": "Wedding Bouquet, Veil and Ring", "explanation": "Another reference to the song 'The Man Who Married A Robot,' which narrates the story of a lonely man named @SnowflakeSmasher86 who develops a romantic connection with the internet and essentially marries a computer. This character symbolizes themes of isolation, reliance on digital data, and the pervasive obsession with social media and the internet in contemporary society. Matty's admission that he relates to this character excessively, even if he may not want to acknowledge it, indicates that the song functions as a commentary on the existing dystopian reality within the technology and social media era. It could also serve as a cautionary tale regarding the potential future consequences if society continues on the same trajectory."},
  {"id": 53, "name": "No!", "explanation": "In today's world, many people often feel trapped in the online realm, even when they don't want to be. They sense that the internet is the only place where they are noticed and recognised. This issue is not just personal but characteristic of an entire generation. The internet consumes a significant portion of our time and detracts from our real-world connections. It's essential for us to find a way to break free from this dependence because it can be destructive to many of us, symbolized by the word 'No!'."},
  {"id": 54, "name": "Wipes And Sanitiser", "explanation": "These items are a reference to the year 2020 during the pandemic when these things were essential for everyone."},
  {"id": 55, "name": "Thesaurus", "explanation": "The symbol of thesaurus, is a playful nod to Matty's extensive vocabulary. Fans often tease Matty for his impressive word choices, which are evident in his song lyrics and interviews. This symbol represents his penchant for using elaborate and sophisticated language."},
  {"id": 56, "name": "Cigarette Butts", "explanation": "The mountain of cigarette butts serves as a prominent symbol of Matty's smoking habit, which is a well-known and visible aspect of his life, even during live performances on stage. It signifies the extensive presence of cigarettes in his daily routine and lifestyle."},
  {"id": 57, "name": "'I Love Cum' Mug", "explanation": "The 'I Love Cum' mug is like that inside joke among friends that you just can't let go of! It all started when Matty shared a pic of it, and the internet went wild. Now, it's a mug that's more famous than some celebrities! Sip your tea (or coffee) in style, Matty."},
  {"id": 58, "name": "Xanax 5-23", "explanation": "...is a reference to anti-stress medications mentioned in the song 'Part of the Band.' These medications may be associated with antidepressants that Matty's mother used during postpartum depression (a reference to the song 'She Lays Down') as well as his own use of antidepressants."},
  {"id": 59, "name": "12 Rules For Life", "explanation": "The book '12 Rules for Life' by Jordan Peterson is suspected of a possible connection to the lyrics in The 1975's song 'Petrichor' which includes the line 'love yourself like someone you love.' Interestingly, one of Jordan Peterson's '12 rules' is 'Treat yourself like someone you are responsible for helping.' These parallels suggest that there may be a connection or influence between Peterson's philosophies and The 1975's lyrics, emphasizing the importance of self-love and self-care."},
  {"id": 60, "name": "Airpods Pro", "explanation": "AirPods were among the items that Matty mentioned in his interview titled '10 Things The 1975's Matty Healy Can't Live Without' for GQ."},
  {"id": 61, "name": "Wine Bottle 'Mid Range Malbec'", "explanation": "The wine bottle symbolizes Matty's actions during performances on the 'Still... At Their Very Best' tour. It's basically Matty's onstage party starter kit. During the song 'Robbers,' he drinks wine directly from a bottle on stage. The type of wine varies at different concerts, and there's even an Instagram page where fans post pictures of the specific wine variety Matty had at each performance. This has become a notable aspect of the tour, and fans pay close attention to the wine selection."},
  {"id": 62, "name": "Blood On The Flag", "explanation": "The blood on the American flag is a reference to the song 'I Like America and America Likes Me.' This song is a political statement by Matty, addressing the issue of gun violence in the United States. The song has sparked important conversations about America's political climate and the role of art in addressing these issues."},
  {"id": 63, "name": "Magnifying Glass", "explanation": "The magnifying glass is a reference to the lyrics in the song 'The 1975,' (BFIAFL) specifically the line 'We're experiencin' life through the postmodern lens.' In his songwriting, Matty often discusses the shortcomings of modernism and expresses his belief in the rise of postmodernism. The magnifying glass serves as a visual representation of this idea, highlighting his focus on postmodern themes."},
  {"id": 64, "name": "STD Positive", "explanation": "This is a reference to the song 'Give Yourself a Try,' particularly the line 'And getting STDs at twenty-seven really isn't the vibe.' In this song, Matty offers advice on how to find happiness in life, especially at a younger age, and the main advice is to 'go outside.' He emphasises the importance of experiencing life beyond the digital realm. However, he also acknowledges the risk of contracting sexually transmitted diseases (STDs) when engaging in risky behaviours, emphasising the need for protection and caution."},
  {"id": 65, "name": "26 Petrol Stations", "explanation": "This is a reference to the song 'It's Not Living (If It's Not With You),' where the protagonist Danny works at a petrol station. The line 'Oh, and Johnny got a job in a bank, I think' later in the song suggests that having a job at a petrol station isn't seen as a prestigious role, possibly implying that the character might not be entirely trustworthy. The term 'petrol' can also be slang for cocaine, suggesting a potential connection to drug dealing or addiction in the song's context."},
  {"id": 66, "name": "List Of Names", "explanation": "The list of names of the band represents the various names the group had before settling on their current name. The band went through many name changes before Matty came up with the name 'The 1975'"},
  {"id": 67, "name": "Cafe Nero", "explanation": "Matty once worked for Caffe Nero, with The 1975 star's stint of employment at the well known coffee chain not exactly going to plan, with him getting the sack after a week but still pretending to work there."},
  {"id": 68, "name": "Not An Apple Juice", "explanation": "There have been quite a few piss references over the last couple of years. This bottle is a nod to Matty and his bathroom breaks."},
  {"id": 69, "name": "Anticrist", "explanation": "It's a song of 1975. The absence of the song in the band's performances could be part of an inside joke between the fans and the band. Matty has contributed to the decision not to play this song, and it might be simply part of their humour. Another possibility is that the band faced issues with the original files or tracks for this song, such as losing them or having the files damaged. Some speculate that 'Antichrist' might be challenging to perform with their current equipment and sound setup. There's also speculation that the song itself or its lyrics might evoke strong emotional responses in Matty, which could be a reason for not wanting to play it."},
  {"id": 70, "name": "Hot Raisins", "explanation": "Hot raisins is a meme that originated from an interview where Matty mentioned, while being drunk, that he loves hot raisins. Later, he clarified that hot raisins are a component of an English dessert, typically found in pudding, which contains raisins. This meme has gained popularity among fans as a humorous reference."},
  {"id": 71, "name": "Return To Danny", "explanation": "The large canister of gasoline is a reference to the main character Danny in the song 'It's Not Living (If It's Not With You)' who works at a petrol station."},
  {"id": 72, "name": "Oxygen", "explanation": "The oxygen mask was initially mentioned in 2022 as part of Matty's tour preparations, where he used it for training and to enhance his stage performance stamina. It later made appearances during live shows, including the video 'ATPOAIM: Still… at their very best,' which announced the North American Tour 2023. In the video, he's seen using an oxygen mask right after waking up. The juxtaposition of a rock star using an oxygen mask while also often having a cigarette in his mouth adds an intriguing layer to the band's stage presence and Matty's persona."},
  {"id": 73, "name": "Coke", "explanation": "Coca-Cola - one of Matty's favorite beverages. He has been seen with it so frequently that it led to playful comments from fans, questioning whether he drinks water at all."},
  {"id": 74, "name": "PX Pills", "explanation": "This pills is a medication used to treat Parkinson's disease, particularly for leg tremors. It might symbolize Matty's sometimes unusual electrifying stage moves, suggesting that he might benefit from tranquilizers. It could also allude to Matty's past struggles with various substances."},
  {"id": 75, "name": "Lemaire Loafers", "explanation": "Matty has been frequently spotted wearing expensive Lemaire piped leather loafers in black throughout both 2022 and 2023, and they have become one of his signature fashion choices."},
  {"id": 76, "name": "Flame And Wok", "explanation": "The box from a delivery is a reference to the time when Matty worked at The Flame and Wok, a Chinese restaurant, while his bandmates, also took on jobs there.  It's a nod to their pre-fame days and the shared work experience they had."},
  {"id": 77, "name": "Whiskey", "explanation": "A gallon of whiskey is a reference to the song 'Give Yourself a Try' with the lyrics 'Growing a beard's quite hard, and whiskey never starts to taste nice.' These lyrics symbolize the challenges and difficulties that people faced as they grew older."},
  {"id": 78, "name": "Typewriter", "explanation": "Pre-ABIIOR Matty was known for sharing letters he had written on his typewriter."},
  {"id": 79, "name": "True Romance", "explanation": "...is a reference to the song 'Robbers,' which was originally inspired by Matty's love for the Quentin Tarantino film 'True Romance.' This film tells the story of an Elvis-obsessed loner who falls in love and marries a prostitute. In the movie, the couple runs away to California after a series of events involving violence and drug-related crime. The appeal of the film lies in its portrayal of a hopelessly romantic notion, where two people can meet and instantly fall in love, embarking on an escape story where love prevails against all odds. This theme and sentiment are reflected in the song." },
  {"id": 80, "name": "TikTok", "explanation": "The TikTok symbol is a reference to The 1975's increased popularity through short videos on TikTok. These videos, often posted by fans during the 'Still... At Their Very Best' tour, contributed to the band's growing presence on the platform."},
  {"id": 81, "name": "Panasonic T-Shirt", "explanation": "When Matty rocked this pink, snug T-shirt at the Pitchfork Festival in Paris 2019, it was like a fashion statement with a hint of fabulousness. It turned heads and fueled playful speculations about his style and, of course, his charisma, sparking a whirlwind of humorous comments about his fashion choices and his undeniable charm."},
  {"id": 82, "name": "Join 1975 FU", "explanation": "tbh I don't know what's the reference here, so will be happy if you know it and share with us in comments"},
  {"id": 83, "name": "Cow in a sweater", "explanation": "...is a playful reference to the lyrics in the song 'When We Are Together,' where it goes: 'You ask about the cows, wearing my sweater.' It's a clever play on words, where, on one hand, the girl is asking Matty something while wearing his sweater, and on the other, she's inquiring about cows that are wearing his sweater. This phrase has become quite the hit meme among fans."},
  {"id": 84, "name": "Coyote", "explanation": "...also known as 'I Like America and America Likes Me,' was a performance art piece by the conceptual artist Joseph Beuys in 1974. In this performance, Beuys spent several days in a room with a live coyote. The artwork explored themes of human and animal interaction, isolation, and communication. Interestingly, The 1975 has a song with the same title, and these themes of interaction, isolation, and communication are recurrent in the band's songs, drawing a parallel between Beuys' performance art and the band's music."},
  {"id": 85, "name": "Raw Steak", "explanation": "Headlines such as 'The 1975's Matty Healy Ate A Raw Steak' generated significant buzz in the media following Matty's on-stage act of consuming a raw steak. However, it's essential to appreciate that this moment should be seen as a metaphorical element within an art performance rather than a literal action."},
  {"id": 86, "name": "Glassjaw hoodie", "explanation": "This hoodie is Matty's favorite hoodie, which he wore almost all the time during his teenage years, from the ages of 14 to 19."},
  {"id": 87, "name": "Vans", "explanation": "Matty was often spotted rocking Vans, those iconic sneakers, during the years 2014 to 2016. They became a staple of his footwear collection and a vital part of his signature style during that period."},
  {"id": 88, "name": "Just for man hair dyer", "explanation": "...symbolize Matty's hair coloring adventures. He has undergone various hair color transformations, from fiery red to even white hair at different points in time. His hair has become a canvas for self-expression, often reflecting his evolving style and artistic expression."},
  {"id": 89, "name": "Blonde dye", "explanation": "...symbolize Matty's hair coloring adventures. He has undergone various hair color transformations, from fiery red to even white hair at different points in time. His hair has become a canvas for self-expression, often reflecting his evolving style and artistic expression."},
  {"id": 90, "name": "The Man", "explanation": "The imagery of a person lying on the grass with a 'raw' label can be interpreted in different ways. One interpretation is that it may be a reference to the music video for the song 'The Birthday Party.' In a particular scene in the video, various characters, including Matty, lie in a circle on the grass, symbolizing a sense of unity with nature. The 'raw' label likely signifies that in nature, free from gadgets and modern technology, a person reconnects with their primal or raw state. This emphasizes a contrast between the natural world and the often artificial and technology-driven aspects of modern life. Alternatively, this could also refer to a performance element used during the 2023 US tour, where a life-sized wax figure of Matty was placed on the grass. This figure represented self-reflection, offering a unique perspective on oneself from a distance, and creating an associated existential experience."},
  {"id": 91, "name": "The Fort", "explanation": "!!!!!CAUTION, LONGREAD!!!!! The fort serving as a reference to the third part of the video series 'A theatrical performance of an intimate moment,' is an interesting insight. In the final episode, Matty building a fort holds significant symbolism for his personal comfort space. The use of black and white in the first two episodes continues to be intriguing and carries various layers of meaning, including a connection to the self-titled aesthetic and the overarching commentary on fame, celebrity life, authenticity, and vulnerability. Celebrity life often leaves little room for errors, nuance, or self-reflection, and it's evident that Matty, as a performer, enjoys pushing these boundaries. The shift to color when he's inside the fort with his loved ones likely represents his true and authentic self, as he's in a secure and enclosed space, reminiscent of the comfort of childhood. His aversion to the unknown, as expressed in his statement about preferring to be inside the fort, adds depth to this interpretation. Matty's self-awareness about being challenging to like and the time it takes to understand him, coupled with his anxiety when he's away from his inner circle, aligns with his recent statements about transitioning into a new era, embracing authenticity, and shedding his previous persona. The idea that sincerity can be intimidating, especially in terms of public perception, is a powerful theme."},
  {"id": 92, "name": "“Queerbait me daddy”", "explanation": "'Queerbait me daddy' - this is a poster that was painted by one of the fans at the concert of the band in Australia in 2023."},
  {"id": 93, "name": "Green M&Ms", "explanation": "This character appeared on Matty's Instagram page in a photo from a hotel room, where you could see part of green M&M's in boots on the bed. This sparked fan jokes like, 'Are you fu*king the Green M&Ms?' Initially, when the SpokesCandies were created in the 1990s, Green was the token female accompanied by three male candies: Blue, Yellow, and Red. There were rumors that Green's sexy boots and personality were related to a myth that green M&M's were considered aphrodisiacs."},
  {"id": 94, "name": "Perfect Lawn", "explanation": "This is a reference to a performance element used during the 2023 US tour. The green grass took on various forms, serving as both a secondary stage where the band performed several songs and as a location where a life-sized wax figure of Matty lay. Additionally, the 'green grass' can also be linked to the video 'The 1975 - ATPOAIM: Still … at their very best, North American Tour 2023,' where Matty plays the role of a scientist and cultivates the perfect lawn."},
  {"id": 95, "name": "DEUXMOI", "explanation": "Deuxmoi is an Instagram account that publishes various rumors and gossip about celebrities, and both Matty and the band, in general, have been subjects of discussion on this platform multiple times."},
  {"id": 96, "name": "Weed", "explanation": "Marijuana is an item strongly associated with Matty. He has consumed it quite extensively in the past. Furthermore, Matty has acknowledged that cannabis played a significant role in his recovery from heroin addiction. Additionally, the plant helps the singer stabilize his mental well-being, particularly given his family history of depression."},
  {"id": 97, "name": "Let's get an...", "explanation": "There was an explicit fan poster at the band's concert that said, 'Let's get anal' during their first album era. Later, Matty commented on it, saying, 'I will not do anal with somebody who has such a slender grasp on grammar,' which became a famous phrase among fans."},
  {"id": 98, "name": "Matty's Performance", "explanation": "The picture of Matty refers to his performance in the 'Still... At Their Very Best' tour. In that show, he's seen lounging on a couch, smoking, and touching himself, which got a lot of media attention. Matty later explained that this act reflects his experience during the COVID and post-COVID times when he spent many days alone. It's a way of expressing how man might feel in times of isolation."},
  {"id": 99, "name": "Rabbit", "explanation": "...linked to Matty's comments during a 'Over/Under' interview in 2019. He expressed his surprise at the Easter Bunny being chosen as a symbol for Easter. He described it as a convoluted mix of visual ideas and questioned the connection of rabbits to a holiday with profound Christian significance, symbolizing the resurrection of Jesus Christ."},
  {"id": 100, "name": "Dream Machine", "explanation": "...is a device created to elicit psychedelic or dream-like experiences through the use of flickering light. Its presence in this context is tied to a particular narrative. Matty discussed the album 'I Like It When You Sleep, for You Are So Beautiful yet So Unaware of It' (ILIWYS) and how specific musical elements, such as the ethereal piano and synthesizers heard in tracks like 'LostMyHead' and 'The Ballad of Me and My Brain,' drew inspiration from Brion Gysin's Dream Machine."},
  {"id": 101, "name": "Skeleton", "explanation": "The skeleton in the white lab coat is a reference to a performance that took place in the summer of 2023, where a skeleton was dressed in a white lab coat on stage. During this performance, Matty removed the lab coat from the skeleton and put it on himself. Additionally, Matty performed at a Taylor Swift concert while wearing the skeleton outfit."},
  {"id": 102, "name": "Fedora", "explanation": "The fedora reference is related to how Matty posted a meme alluding to a comment he made in an episode of 'The Adam Buxton Podcast' (TAFS) where he joked about Julian Casablancas, the lead singer of The Strokes, needing to wear a fedora. This comment about the fedora could be seen as a playful or sarcastic remark by Matty regarding Julian Casablancas' fashion or appearance."},
  {"id": 103, "name": "The Lab Coat", "explanation": "Matty has been seen wearing a distinctive white lab coat in his live performances and music videos, sparking speculation about its significance in the context of his artistic expression. According to this theory, the lab coat could symbolize an exploration or representation of reality, particularly concerning the profound impact of technology and the internet on our lives and perceptions. This lab coat might convey ideas related to teaching or having authority over a simulated or virtual world shaped by technology. It consistently appears in his performances, transcending the boundaries of a typical home setting, possibly to add a layer of storytelling or to comment on the current technological and online landscape. In essence, this lab coat may serve as a symbol for delving into the realm of simulations and examining how technology and the internet profoundly influence modern life. It underscores the notion that our contemporary world is, in part, constructed or influenced by technological processes."},
  {"id": 104, "name": "Me Me Me", "explanation": "The symbol of the brains with 'Me Me Me' written on them is a reference to the song 'The Ballad of Me and My Brain.' In this song, the lyrics describe a situation in which a person feels like they've lost their 'mind' or 'intelligence.' They feel sad and confused, searching for their 'brain' and wondering where it might be. This metaphor may suggest a loss of control or a sense of being scattered when a person feels forgotten or aimless."},
  {"id": 105, "name": "Red Converse", "explanation": "This footwear was frequently worn by Matty during his performances in 2019, which became his distinctive trademark."},
  {"id": 106, "name": "We've been together for 20 years...", "explanation": "'We've been together 20 years...' - this phrase was so often used by Matty in his interviews and performances that it had to be referenced here. In truth, maintaining a music group's unity for such an extended period is a rare and remarkable achievement. It speaks to the strong bonds and deep understanding among the band members, offering valuable lessons for other musical acts to draw from."},
  {"id": 107, "name": "The Ball Pit", "explanation": "...is a reference to the Tumblr era of the band, when the group gained popularity. Every time Matty mentions the Tumblr era on stage, he says, 'tumblr, dr.Martens, Taylor Swift, and The 1975.' The Tumblr era, spanning 2013-2014, included events like DashCon, initially known as Tumbl-Con USA, which was a fan convention primarily aimed at Tumblr users and focused on various fandoms. The humorous aspect of the ball pit at DashCon was that the organizers offered attendees an 'extra hour' in the ball pit as compensation for the canceled panel and other inconveniences at the convention. However, the size of the ball pit was tiny, similar to a child's playpen, and it was located in an empty conference room. This offer seemed comical and illogical to the attendees, who began creating jokes and memes about it."},
  {"id": 108, "name": "Communism", "explanation": "The communist symbol is used as a reference to Matty's association with this movement, as reflected in his jokes and statements. However, in reality, he humorously parodies the stereotypical image of modern young people who associate themselves with communism in his song 'Part of the Band.' In this track, he amusingly portrays the 'Vaccinista tote bag chic baristas, sitting in east on their communista keisters,' who are enthusiastic supporters of left-wing and progressive ideals. Matty satirizes their common traits and behaviors, emphasizing how they often define themselves through their material possessions and political beliefs. This symbol serves as a reminder of his lighthearted critique of contemporary youth culture."},
  {"id": 109, "name": "Liberal", "explanation": "Matty considers himself a liberal and a progressive. He supports socially progressive issues but also criticizes the excessive rigidity of moral standards often associated with 'woke-ism.' He emphasizes the importance of acknowledging mistakes and personal growth, advocating for a readiness to apologize or change one's perspective when necessary."},
  {"id": 110, "name": "Gretta", "explanation": "Greta Thunberg is an activist who advocates for climate change awareness and action, a cause that Matty has expressed great admiration for. They even collaborated on a song titled 'The 1975,' which aims to raise awareness about environmental issues and climate change. Matty referred to Greta as the 'most punk person' he has ever met and mentioned that her approach to addressing climate change inspired him to be more optimistic and active in this direction. They also support the Extinction Rebellion movement and raise funds for environmental conservation through their music."},
  {"id": 111, "name": "Ripped trouses", "explanation": "Ripped jeans were a staple in Matty's wardrobe during the early stages of The 1975's ascent to fame. He frequently sported this edgy style in music videos, everyday life, and performances. His attire often featured dark color palettes, with ripped skinny jeans and layered knits, predominantly in black hues."},
  {"id": 112, "name": "From Laura To Matty", "explanation": "...is a reference to the lyrics of the song 'The Ballad of Me and My Brain, where the lyrics include the lines: 'And would you sign an autograph for my daughter, Laura? 'Cause she adores you, but I think you're shit.'"},
  {"id": 113, "name": "Suitcase", "explanation": "The suitcase is a reference to the video 'The 1975 - A theatrical performance of an intimate moment (episode 2),' where Matty is seen packing into a suitcase."},
  {"id": 114, "name": "Puppies", "explanation": "The reference to puppies in this context points to the fact that members of The 1975, especially George and Matty, have a fondness for dogs and puppies. The band has created several puppy montages and incorporated these cute animals into their work. For example, in May 2020, a magazine featured exclusive photos and polaroids from The 1975's CDM covershoot, along with a back-page designed by Matty himself. This publication also included a fold-out A2-sized landscape poster featuring The 1975 alongside puppies."},
  {"id": 115, "name": "Banjo", "explanation": "It's impressive that the band members can play multiple instruments, and Matty's ability to play the banjo is an example of their versatility. In 'The Birthday Party,' they skillfully incorporate the banjo and pedal steel guitar, giving the song a unique rural and acoustic vibe."},
  {"id": 116, "name": "Red Sock", "explanation": "tbh I don't know what's the reference here, so will be happy if you know it and share with us in comments"},
  {"id": 117, "name": "Settle Down", "explanation": "A 'Settle Down' sticker is a reference to The 1975's song and music video, which portrays an exceptional, boundless kind of love. Set in North-East England, it initially appears as a drama but gradually takes on a supernatural quality involving two boys. The video is inspired by Matty's recurring dream about a profound universal connection between people, regardless of their gender. It highlights the power of an exceptionally deep sense of unity and love."},
  {"id": 118, "name": "George", "explanation": "George Daniel, the drummer of the band, is depicted behind a computer as he plays a crucial role in composing and producing the group's music. George and Matty collaborate on songwriting and the development of the band's sound, including its electronic elements. George has also taken on a production role, contributing to the formation of The 1975's unique sound, which combines rhythm and electronics with live music."},
  {"id": 119, "name": "Candies", "explanation": "Red Vines are George's favorite candy."},
  {"id": 120, "name": "Panasonic", "explanation": "The Panasonic equipment connected to a MacBook that George uses refers to his contribution to The 1975's music production. He plays a significant role in writing and producing the band's songs, often experimenting with electronic elements and sound."},
  {"id": 121, "name": "Gatorade", "explanation": "Gatorade is George's favorite drink."},
  {"id": 122, "name": "", "explanation": ""},
  {"id": 123, "name": "LGBT FLag", "explanation": "The LGBTQ+ flag is a reference to various moments, including Matty's on-stage kiss with Ross, his gay jokes, his eccentric style that led to rumors about his orientation, and his speeches about freedom of expression, love, acceptance of others, and their perspectives."},
  {"id": 124, "name": "XCX", "explanation": "The 'XCX' sticker is a reference to Charlie XCX, a pseudonym for the girlfriend of George Daniel. George has been in a relationship with Charlie XCX since 2022."},
  {"id": 125, "name": "AO3", "explanation": "This symbol is the logo for AO3, a fan fiction site. Matty and George have mentioned in several interviews that there is fan fiction about them, and Matty has even read some of it aloud before."},
  {"id": 126, "name": "Green vinyl", "explanation": "Will be happy if you tell m eabout it, guys."},
  {"id": 127, "name": "1989 vinyl", "explanation": "The '1989' vinyl serves as a reference to Taylor Swift's album '1989.' Matty and Taylor were in a relationship during the spring of 2023, which drew significant media attention due to their sudden and brief breakup, leading to widespread speculation and rumors. However, it's worth noting that despite previous statements suggesting a collaboration between Matty and Taylor, neither Matty nor The 1975 are part of the album '1989 (Taylor's Version)' that was presented in October 2023."},
  {"id": 128, "name": "Talking Heads Stop Making Sense", "explanation": "This note references The 1975's music video for 'It's Not Living (If It's Not With You).' The video was inspired by Talking Heads' concert film 'Stop Making Sense.' In the video, Matty wears a suit similar to David Byrne's iconic outfit in the Talking Heads film. The video incorporates various elements and imagery from Talking Heads, including performance style and dancers, paying homage to the influential musical performance."},
  {"id": 129, "name": "What A Shame", "explanation": "Matty often uses the phrase 'what a shame' in the songs, like 'Love Me,' 'The Ballad of Me and My Brain,' 'Paris,' and 'She's American.' It's like a secret code for their fans and adds to the band's identity. It can mean different things, often being a clever way to comment on life and society. Matty uses it for irony and humor in his lyrics, expressing emotions and thoughts. It's a unique way to convey feelings in their songs."},
  {"id": 130, "name": "Pinguin", "explanation": "The pinguin refers to a tattoo on Ross's arm, which doesn't hold a specific meaning but is personally significant to him. In a playful manner, fans have jokingly dubbed him a 'penguin lover' due to this tattoo."},
  {"id": 131, "name": "Ross", "explanation": "Ross's long hair and beard, the bassist of the band, have led fans to affectionately refer to him as resembling Jesus Christ. In addition to his musical talents, Ross has become a favorite among female fans, who appreciate his attractiveness and charm."},
  {"id": 132, "name": "Kisses", "explanation": "The symbols of kisses can be interpreted in various ways, such as Ross becoming a heartthrob with his new style during the 2023 tour or as a reference to the kiss between Matty and Ross on stage in Malaysia."},
  {"id": 133, "name": "I Hate Matty Healy", "explanation": "The 'I Hate Matty Healy' merch featuring this phrase has become popular among fans. It's a form of irony that playfully mocks the hate directed towards Matty and his behavior."},
  {"id": 134, "name": "Bees", "explanation": "The mention of bees is connected to The Manchester worker bee symbol, which has represented the city for over 150 years. This is significant because The 1975 started their career in Manchester."},
  {"id": 135, "name": "Smth on a finger", "explanation": ""},
  {"id": 136, "name": "Cigarets", "explanation": "The cigarette packs are a reference to the fact that Matty smokes a lot."},
  {"id": 137, "name": "Greggs Food", "explanation": "The mention of the Greggs sausage roll (British pastry) refers to a funny incident during The 1975's UK tour when a fan threw one on stage, and Matty took a bite of it."},
  {"id": 138, "name": "Robber", "explanation": "...is a reference to the main character in The 1975's famous song and music video 'Robbers,' which played a significant role in boosting the band's popularity."},
  {"id": 139, "name": "Shirt with Roses", "explanation": "The shirt with roses is the one Matty wore as the main character in the 'Robbers' music video. It became a symbol of the song, inspiring fan art and tattoos with roses, guns, and the video's lovers, which fans often got as a tribute to the song."},
  {"id": 140, "name": "Lights Out!", "explanation": "The reference to turning off the lights is alluding to how Ross used to turn off the stage lights during the concerts on the 'Still... At Their Very Best' tour."},
  {"id": 141, "name": "Footbal ball", "explanation": "The football ball that the Robber is seen playing with symbolizes The 1975's well-known passion for football."},
  {"id": 142, "name": "Vaccinated + Proud Bag", "explanation": "This bag is a symbolic image that relates to the song 'Part of the Band.' In the song's lyrics, there's a line that goes, 'I know some Vaccinista tote bag chic baristas, sitting in east on their communista keisters.' This line alludes to a specific cultural trend.In contemporary pop culture, there's a prevalent aesthetic associated with left-wing, queer individuals who love coffee (especially with oat milk). They are known for their fashion sense and popularized the tote bag trend around 2020.In 'Part of the Band,' Matty explores post-modern gender roles to find his place in modern society. The term 'Vaccinista' represents individuals who define themselves by material possessions and political beliefs, a growing trend in today's commercialized and politically polarized world.Matty humorously turns 'vaccinated' into 'Vaccinista' and uses wordplay to play down their significance. He also mocks the idea of assigning specific meanings to objects like tote bags as indicators of one's sexual orientation or beliefs, highlighting the reductionism and inaccuracy of such judgments."},
  {"id": 143, "name": "Baraka", "explanation": "...is a favorite character from the game 'Mortal Kombat' for Matty. Additionally, he has a dragon tattoo on the inner side of his right forearm, which is a symbol from the game 'Mortal Kombat'."},
  {"id": 144, "name": "Circumcision Stapler", "explanation": "The 'Circumcision Stapler' is just a little reminder that Matty is a member of the snipped club as he revealed on the show 'Over/Under.'"},
  {"id": 145, "name": "", "explanation": ""},
  {"id": 146, "name": "", "explanation": ""},
  {"id": 147, "name": "Ring on Rope", "explanation": ""},
  {"id": 148, "name": "Pink Scarf", "explanation": ""},
  {"id": 149, "name": "Essential Oil", "explanation": "The reference to the essential oil bottle is likely connected to an interview in which Matty was asked about his favorite essential oil, and he responded 'Petrol (gasoline),' most likely alluding to the song 'It's Not Living If It's Not With You' and its protagonist Danny, who works at a petrol station, doing what?.. *selling petrol*"},
  {"id": 150, "name": "'S'", "explanation": "The 'S' symbol is a reference to the 'Superman' symbol. Each member of the band has it as a matching tattoo."},
  {"id": 151, "name": "Infinite Jest", "explanation": "The presence of David Foster Wallace's 'Infinite Jest' in this picture serves as a reference to Matty's time in rehab, symbolizing the routine and loneliness he experienced while reading the book during that period. Additionally, the title of his song 'Surrounded by Heads and Bodies' is directly inspired by this book."},
  {"id": 152, "name": "American flag", "explanation": "The American flag in the context of The 1975 is a representation of American themes and culture that are frequently mentioned in their music. They explore themes like characteristics and issues of contemporary American society in songs 'She's American' and 'I Like America & America Likes Me.' The band has also toured the United States multiple times and gained a big following there."}
]